Project/Toir.Adaptation/src/Documents/торо_НарядНаРегламентноеМероприятие/торо_НарядНаРегламентноеМероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_НарядНаРегламентноеМероприятие</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections>
    <name>РегламентныеМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>МестоПроведенияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОпаснаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_НарядНаРегламентноеМероприятие/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьНовыеЭлементы();
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	
	МассивРеквизитов = Новый Массив();	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_ВремяРаботыТекст", Новый ОписаниеТипов("Строка",,,, 
		Новый КвалификаторыСтроки(24)), "Объект.Исполнители"));
	ИзменитьРеквизиты(МассивРеквизитов);
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	
	НЭлем = Элементы.Добавить("Исполнителигкс_ВремяРаботы", Тип("ПолеФормы"), Элементы.Исполнители);
	НЭлем.ПутьКДанным = "Объект.Исполнители.гкс_ВремяРаботы";
	НЭлем.Заголовок = "Время работы";
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.Видимость = Ложь;
	НЭлем.Доступность = Ложь;
	//
	НЭлем = Элементы.Добавить("Исполнителигкс_ВремяРаботыТекст", Тип("ПолеФормы"), Элементы.Исполнители);
	НЭлем.ПутьКДанным = "Объект.Исполнители.гкс_ВремяРаботыТекст";
	НЭлем.Заголовок = "Время работы";
	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
	НЭлем.КнопкаВыбора = Истина;
	НЭлем.РедактированиеТекста = Ложь;
	НЭлем.УстановитьДействие("НачалоВыбора", "Расш_гкс_ИсполнителиВремяРаботыТекстНачалоВыбора");
	НЭлем.УстановитьДействие("ОбработкаВыбора", "Расш_гкс_ИсполнителиВремяРаботыТекстОбработкаВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ИсполнителиВремяРаботыТекстНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Исполнители.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		
		торо_ЗаполнениеДокументовКлиент.ОткрытьФормуПодбораПродолжительности(ТекущиеДанные.гкс_ВремяРаботы,Элемент,Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ИсполнителиВремяРаботыТекстОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Исполнители.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(ВыбранноеЗначение);
		ТекущиеДанные.гкс_ВремяРаботы      = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Расш_гкс_ПослеЗаписиНаСервереВместо(ТекущийОбъект, ПараметрыЗаписи)
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Расш_гкс_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	Для каждого Строка Из Объект.Исполнители Цикл
		Строка.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(Строка.гкс_ВремяРаботы);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПолучитьМассивСтруктурИсполнителей")
Функция Расш_гкс_ПолучитьМассивСтруктурИсполнителей()
	Массив = Новый Массив;

	Для каждого СтрокаРемонтовОборудования Из Объект.РегламентныеМероприятия Цикл

		МассивСтрокРемонныхРабот = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID));

		Для каждого СтрокаРемонтныхРабот Из МассивСтрокРемонныхРабот Цикл

			МассивИсполнителей = Объект.Исполнители.НайтиСтроки(Новый Структура("РемонтыОборудования_ID, ID", СтрокаРемонтовОборудования.ID, СтрокаРемонтныхРабот.ID));

			Для каждого СтрокаИсполнителя Из МассивИсполнителей Цикл

				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);
				СтруктураСтроки.Вставить("Квалификация"          , СтрокаИсполнителя.Квалификация);
				СтруктураСтроки.Вставить("ДатаНачала"            , СтрокаИсполнителя.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончания"         , СтрокаИсполнителя.ДатаОкончания);
				#Вставка
				СтруктураСтроки.Вставить("ВремяРаботы"           , СтрокаИсполнителя.гкс_ВремяРаботы);
				#КонецВставки
				СтруктураСтроки.Вставить("Сотрудник"             , СтрокаИсполнителя.Сотрудник);

				Массив.Добавить(СтруктураСтроки);

			КонецЦикла;

			Если Не ТипЗнч(СтрокаРемонтныхРабот.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт")
				И Не МассивИсполнителей.Количество() > 0 Тогда //нужно отразить хотя бы тех операции.

				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("РемонтыОборудования_ID", СтрокаРемонтовОборудования.ID);
				СтруктураСтроки.Вставить("ID"                    , СтрокаРемонтныхРабот.ID);
				СтруктураСтроки.Вставить("Родитель_ID"           , СтрокаРемонтныхРабот.Родитель_ID);
				СтруктураСтроки.Вставить("РемонтнаяРабота"       , СтрокаРемонтныхРабот.РемонтнаяРабота);
				СтруктураСтроки.Вставить("ОбъектРемонта"         , СтрокаРемонтовОборудования.ОбъектРемонта);
				СтруктураСтроки.Вставить("ВидРемонта"            , СтрокаРемонтовОборудования.ВидРемонтныхРабот);
				СтруктураСтроки.Вставить("ДатаНачалаРемонта"     , СтрокаРемонтовОборудования.ДатаНачала);
				СтруктураСтроки.Вставить("ДатаОкончанияРемонта"  , СтрокаРемонтовОборудования.ДатаОкончания);

				СтруктураСтроки.Вставить("Квалификация");
				СтруктураСтроки.Вставить("ДатаНачала");
				СтруктураСтроки.Вставить("ДатаОкончания");
				СтруктураСтроки.Вставить("ВремяРаботы");
				СтруктураСтроки.Вставить("СуммаКНачислению");
				СтруктураСтроки.Вставить("Сотрудник");

				Массив.Добавить(СтруктураСтроки);

			КонецЕсли; 

		КонецЦикла; 
	КонецЦикла; 

	Возврат Массив;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ОбработкаАвтоматическогоЗаполненияИсполнителей")
Процедура Расш_гкс_ОбработкаАвтоматическогоЗаполненияИсполнителей(Результат, ДопПараметры)

	Если Не Результат = Неопределено И ТипЗнч(Результат) = Тип("Массив") Тогда
		Объект.Исполнители.Очистить();
		Для каждого СтрокаМассива Из Результат Цикл
			НС = Объект.Исполнители.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаМассива);
			#Вставка
			НС.гкс_ВремяРаботы = СтрокаМассива.ВремяРаботы;
			НС.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(СтрокаМассива.ВремяРаботы);
			#КонецВставки
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаполнитьИсполнителей")
Процедура Расш_гкс_ЗаполнитьИсполнителей(Адрес)

	Если Адрес = Неопределено Тогда возврат; КонецЕсли;

	тз = ПолучитьИзВременногоХранилища(Адрес);

	стрОтбора = Новый Структура("РемонтыОборудования_ID, ID");

	Для каждого текСтрока из Тз Цикл
		ЗаполнитьЗначенияСвойств(стрОтбора, текСтрока);
		НайС = Объект.Исполнители.НайтиСтроки(стрОтбора);

		Для каждого ТезЗапись из НайС Цикл
			Объект.Исполнители.Удалить(ТезЗапись);
			Модифицированность = Истина;
		КонецЦикла;
	КонецЦикла;

	Для каждого текСтрока из Тз Цикл
		нс = Объект.Исполнители.Добавить();
		ЗаполнитьЗначенияСвойств(нс, текСтрока);
		#Вставка
		НС.гкс_ВремяРаботы = текСтрока.ВремяРаботы;
		НС.гкс_ВремяРаботыТекст = Расш_гкс_СформироватьПродолжительность(текСтрока.ВремяРаботы);
		#КонецВставки
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиентеНаСервереБезКонтекста
Функция Расш_гкс_СформироватьПродолжительность(ПродолжительностьВСекундах)
	
	Если ПродолжительностьВСекундах = 0 Тогда
		
		Возврат "Ввести продолжительность";
		
	Иначе
		
		Часы    = Цел(ПродолжительностьВСекундах / 3600);
		Минуты  = Цел((ПродолжительностьВСекундах - 3600 * Часы) / 60);
		Секунды = ПродолжительностьВСекундах - 3600 * Часы - Минуты * 60;
		
		Возврат "" + Часы + " ч. " + Минуты + " мин. " + Секунды + " с.";
		
	КонецЕсли;
	
КонецФункции




#КонецОбласти
